Repository: thitipong-k/motus_lab
Catalog: lib/l10n/app_*.arb
Languages: th

# titleDeviceSelection
source: Device Selection
th: เลือกอุปกรณ์

# btnConnect
source: Connect
th: เชื่อมต่อ

# btnConnected
source: Connected
th: เชื่อมต่อแล้ว

# btnDisconnect
source: Disconnect
th: ตัดการเชื่อมต่อ

# btnScan
source: Scan
th: สแกน

# btnStop
source: Stop
th: หยุด

# lblScanning
source: Scanning for OBDII devices...
th: กำลังค้นหาอุปกรณ์ OBDII...

# lblConnecting
source: Connecting to device...
th: กำลังเชื่อมต่ออุปกรณ์...

# lblConnected
source: Connected successfully!
th: เชื่อมต่อสำเร็จ!

# lblError
source: Error: {message}
th: เกิดข้อผิดพลาด: {message}

# msgNoDevices
source: No devices found. Tap refresh to scan.
th: ไม่พบอุปกรณ์ กดปุ่มรีเฟรชเพื่อสแกนใหม่

# msgTapToScan
source: Tap refresh to start scanning
th: กดปุ่มรีเฟรชเพื่อเริ่มสแกน
